yigeiwo/meeting-smart-minutes/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 本 UI 只有少量标签 + 一个像素吉祥物, 32KB 池对 C3 来说太奢侈:
# 实测启动后仅剩 3KB, 而一次 wss(TLS) 连接需要约 20KB, 必须把池降下来。
CONFIG_LV_MEM_SIZE_KILOBYTES=20
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_TXT_ENC_ASCII=n
CONFIG_LV_USE_FONT_COMPRESSED=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n

# --- 内存预算 (ESP32-C3 无 PSRAM, 可用动态 RAM 只有约 190KB) ---
# 本固件必须同时容纳: NimBLE(蓝牙配网) + Wi-Fi STA(桥接) + LVGL(屏幕) + I2S(音频)
# + 带 TLS 的 WebSocket 客户端。实测四项开销: Wi-Fi 驱动初始化约 39KB,
# NimBLE 约 30KB 起, LVGL 池 32KB, TLS 连接约 20KB 起。
#
# 配网报文实测约 151 字节, ATT MTU=256 时仍可单次 write 下发(需要 ≥154),
# 把 MTU 从 512 降到 256 可显著缩小 NimBLE 的 msys 块开销。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
#
# Wi-Fi 静态 RX 缓冲默认 10 个 x 1.6KB ≈ 16KB, 配网与 NDJSON 桥接用不到这么多,
# 降到 6 个 (注意: 必须满足 RX_BA_WIN <= 2 x STATIC_RX_BUFFER_NUM, 默认窗口为 6)。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
#
# TLS 输入缓冲默认 16KB, 而本项目的下行报文都是短 JSON (会议纪要/指令),
# 8KB 足够; 省下的内存留给 Wi-Fi 与桥接任务栈。
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
